#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НаборДвижений = Движения.отусВзаиморасчетыСКлиентами;
	НаборДвижений.Записывать = Истина;
	
	Движение = НаборДвижений.ДобавитьПриход();
	Движение.Период			= Дата;
	Движение.Организация	= Организация;
	Движение.Клиент 		= Клиент;
	Движение.ЗаказКлиента 	= ЗаказКлиента;
	Движение.Сумма 			= СуммаДокумента;
	
	Движения.Записать();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.отусЗаказКлиента") Тогда
		
		ЗаказКлиента = ДанныеЗаполнения.Ссылка;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация,Клиент,СуммаДокумента");
				
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
	
#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли