#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НаборДвижений = Движения.отусОстаткиИнструментов;
	НаборДвижений.Записывать = Истина;
	
	Для каждого ТекущаяСтрока Из Состав Цикл
	    Движение = НаборДвижений.ДобавитьПриход();
		Движение.Период			= Дата;
		Движение.Склад 			= Склад;
		Движение.Инструмент 	= ТекущаяСтрока.Инструмент;
		Движение.Количество     = ТекущаяСтрока.Количество;
	КонецЦикла;
	
	Движения.Записать();
	
КонецПроцедуры

#КонецОбласти
	
#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли